system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 1;

// 1. 顶点定义（严格匹配 x∈[0,10], y∈[0,1], z∈[0,2]）
// 顶点索引规则：(x,y,z) → 按 x从0→10、y从0→1、z从0→2 排列
// 三维改成二维，将y方向厚度设为1单位，取x=5m, 划分25份，故一份为0.2m
// x方向为5m，y方向为0.2m，z方向为2m
// x方向25份，y方向1份，z方向10份
vertices
(
    (0    0    0)   // 0: 底面左下角→ 块的“0”号顶点
    (5    0    0)   // 1: 底面右下角→ 块的“1”号顶点
    (5    0.2  0)   // 2: 底面右上角→ 块的“2”号顶点
    (0    0.2  0)   // 3: 底面左上角→ 块的“3”号顶点
    (0    0    2)   // 4: 顶面左下角→ 块的“4”号顶点（0的正上方）
    (5    0    2)   // 5: 顶面右下角→ 块的“5”号顶点（1的正上方）
    (5    0.2  2)   // 6: 顶面右上角→ 块的“6”号顶点（2的正上方）
    (0    0.2  2)   // 7: 顶面左上角→ 块的“7”号顶点（3的正上方）
);

// 2. 块定义（网格划分：x方向25份，y方向1份，z方向10份，平衡精度与结构）
// 顶点顺序：(0 1 2 3 4 5 6 7) → 对应 hex 块的8个顶点（前4个底面，后4个顶面）
blocks
(
    hex (0 1 2 3 4 5 6 7) (50 1 50) simpleGrading (1 1 1)
);

edges();

// 3. 边界定义（关键：周期性边界配对+顶点顺序反向）
boundary
(
    left
    {
        type empty;
        faces
        (
            (0 4 5 1) 
        );
    }
    right
    {
        type empty;
        faces
        (
            (3 2 6 7)  
        );
    }


    inlet
    {
        type patch;
        faces ((1 5 6 2)); 
    }
    outlet
    {
        type patch;
        faces ((0 3 7 4)); 
    }

    // z方向非周期性
    top
    {
        type wall;
        faces ((0 1 2 3)); 
    }
    bottom
    {
        type wall;
        faces ((4 7 6 5)); 
    }
);

