constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  powerLaw;  // 指定幂律模型

rho             [1 -3 0 0 0 0 0] 1000;  // 密度仍需定义（用于计算nu）
nu              [0 2 -1 0 0 0 0] 0.02;  // 运动黏度  

powerLawCoeffs
{
    k           1e-6;          // 运动黏度 ？不确定，ai说是一致性系数
    n           0.8;           // 流动行为指数
    nuMin       1e-6;         
    nuMax       1e3;          
}

    
